![data-x](http://oi64.tinypic.com/o858n4.jpg)


# Homework 3: Pandas & Visualization

**Author: ** Alexander Fred Ojala

**Questions: ** Post them on the class Piazza *IEOR 190D & 290 Data-X* (https://piazza.com/class/iy6i5458rva2ud) or email afo@berkeley.edu

___

## Q1 Read in the data

* 1: Read in the data stored in the CSV file at this URL https://www.dropbox.com/s/cz2kpe1oklwif3j/data3.csv?dl=1 to a Pandas DataFrame called `df`. 

**Note:** Use pandas method `pd.read_csv('URL')` or download the file, place it in the same folder as the notebook and use `pd.read_csv('file_name')`.

Please run `df.head()`, it should produce the following output:

<img src="https://www.dropbox.com/s/m19qu65cb5g2dci/hw3.1.df.head.png?dl=1" width="600" height="200" />

### Data description
**Data source:** http://www.fao.org/nr/water/aquastat/data/query/index.html?lang=en

**Data, units:** 
- GDP, current USD (CPI adjusted)
- NRI, mm/yr
- Population density, inhab/km^2
- Total area of the country, 10 ha = 0.1km^2
- Total Population, unit 1000 inhabitants

In [1]:
# Load required modules
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt

df = pd.read_csv('https://www.dropbox.com/s/cz2kpe1oklwif3j/data3.csv?dl=1')
df.head()

,Area,Area Id,Variable Name,Variable Id,Year,Value,Symbol,Md
0,Argentina,9.0,Total area of the country,4100.0,1962.0,278040.0,E,NaN
1,Argentina,9.0,Total area of the country,4100.0,1967.0,278040.0,E,NaN
2,Argentina,9.0,Total area of the country,4100.0,1972.0,278040.0,E,NaN
3,Argentina,9.0,Total area of the country,4100.0,1977.0,278040.0,E,NaN
4,Argentina,9.0,Total area of the country,4100.0,1982.0,278040.0,E,NaN

## Q2 Data preprocessing / Clean up the data

* 1: **Drop rows**: First get rid of all the unnecessary bottom rows in `df` that do not have any country information the Area column. (Hint: Inspect the CSV file in order to find out which rows to get rid of)

* 2: **Drop columns**: drop the columns **Area Id, Variable Id, Symbol**, and **Md**.

* 3: **Convert the 'Year' column string values** to pandas datetime objects, where only the year is specified. To do this, simply run the code below (please review it carefully and make sure you understand what happens):
    
    `df['Year'] = pd.to_datetime(pd.Series(df['Year']).astype(int),format='%Y').dt.year`



Run `df.tail()`, it should produce the following output:


<img src="https://www.dropbox.com/s/706luf5z492psnv/hw3.1.df_tail.png?dl=1&1" width="600" height="200" />

In [2]:
df = df.drop(df.index[390:])
df.tail()

,Area,Area Id,Variable Name,Variable Id,Year,Value,Symbol,Md
385,United States of America,231.0,National Rainfall Index (NRI),4472.0,1981.0,949.2,E,NaN
386,United States of America,231.0,National Rainfall Index (NRI),4472.0,1984.0,974.6,E,NaN
387,United States of America,231.0,National Rainfall Index (NRI),4472.0,1992.0,1020.0,E,NaN
388,United States of America,231.0,National Rainfall Index (NRI),4472.0,1996.0,1005.0,E,NaN
389,United States of America,231.0,National Rainfall Index (NRI),4472.0,2002.0,938.7,E,NaN

In [3]:
df = df.drop(df.columns[[1, 3, 6, 7]], axis = 1)
df.head()

        Area              Variable Name    Year     Value
0  Argentina  Total area of the country  1962.0  278040.0
1  Argentina  Total area of the country  1967.0  278040.0
2  Argentina  Total area of the country  1972.0  278040.0
3  Argentina  Total area of the country  1977.0  278040.0
4  Argentina  Total area of the country  1982.0  278040.0

In [4]:
df['Year'] = pd.to_datetime(pd.Series(df['Year']).astype(int),format='%Y').dt.year
df.head()

        Area              Variable Name  Year     Value
0  Argentina  Total area of the country  1962  278040.0
1  Argentina  Total area of the country  1967  278040.0
2  Argentina  Total area of the country  1972  278040.0
3  Argentina  Total area of the country  1977  278040.0
4  Argentina  Total area of the country  1982  278040.0

## Q3 Extract specific statistics
* 1: Print the years when the National Rainfall Index (NRI) was greater than 950 or less than 900 in Iceland, by using this code:


`df[(df['Area']=='Iceland') & (df['Variable Name']=='National Rainfall Index (NRI)') & ( (df['Value']>950) | (df['Value']<900) )]['Year']`
    
    
* 2: Print the countries where 'Total area of the country' has a Value > 40000 (hint: when you have extracted the results you can use the `.unique()` method to only print the unique countries).

* 3: Print the rows where 'Population density' has a Value > 65

In [5]:
df[(df['Area']=='Iceland') & (df['Variable Name']=='National Rainfall Index (NRI)') & ( (df['Value']>950) | 
                                                                                       (df['Value']<900) )]['Year']

214    1967
215    1971
216    1975
218    1986
219    1991
220    1997
Name: Year, dtype: int64

In [6]:
df[(df['Variable Name'] == 'Total area of the country') & (df['Value'] > 40000)]['Area'].unique()

array(['Argentina', 'Australia', 'Sweden', 'United States of America'], dtype=object)

In [7]:
df[(df['Variable Name'] == 'Population density') & (df['Value'] > 65)]

        Area       Variable Name  Year   Value
136  Germany  Population density  1962  208.00
137  Germany  Population density  1967  216.00
138  Germany  Population density  1972  220.50
139  Germany  Population density  1977  220.00
140  Germany  Population density  1982  218.00
141  Germany  Population density  1987  218.10
142  Germany  Population density  1992  224.30
143  Germany  Population density  1997  229.70
144  Germany  Population density  2002  228.80
145  Germany  Population density  2007  226.40
146  Germany  Population density  2012  225.30
147  Germany  Population density  2015  225.80
256  Ireland  Population density  2012   66.42
257  Ireland  Population density  2015   66.70

# Q4 US Data Exploration
* 1: Create a new DataFrame called **`df_us`** that only contains values where 'Area' is equal to 'United States of America'. Set the indices to be the 'Year' column and pivot the DataFrame so that the unique 'Variable Name' entries becomes the column entries. The DataFrame values should be the ones in the the 'Value' column. Do this by running the three lines of code below:

        1. df_us = df[df['Area']=='United States of America']
        2. df_us.set_index('Year',inplace=True)
        3. df_us=df_us.pivot(columns='Variable Name',values='Value')
        
        
* 2: Rename the columns to `['GDP','NRI','PD','Area','Population']`.


* 3: Multiply the Area for all countries by 10 (so instead of 10 ha, the unit becomes 100 ha = 1km^2)


* 4: Create a new column in df_us called 'GDP/capita' and populate it with the calculated GDP per capita. Round the results to two decimal points.


* 5: Create a new column called 'PD2' (i.e. Population density 2). Calculate the Population density. **Note: the units should be inhab/km^2** (see Data description above). Round the reults to two decimal point.


**Running `df_head()`** should produce:

<img src="https://www.dropbox.com/s/0bwrca41cmc5w09/hw3.1.df_head_2.png?dl=1&2" width="600" height="200" />

In [73]:
df_us = df[df['Area'] == 'United States of America']
df_us.set_index('Year', inplace = True)
df_us = df_us.pivot(columns = 'Variable Name', values = 'Value')

In [74]:
df_us.columns = ['GDP', 'NRI', 'PD', 'Area', 'Population']

In [75]:
df_us['Area'] = df_us['Area'] * 10

In [76]:
df_us['GDP/capita'] = df_us['GDP']/df_us['Population']
df_us['GDP/capita'] = (df_us['GDP/capita']/1000).round(decimals = 2)

In [87]:
df_us['PD2'] = (df_us['Population']*1000/df_us['Area']).round(decimals = 2)
df_us.head()

               GDP     NRI      PD       Area  Population  GDP/capita    PD2
Year
1962  6.050000e+11     NaN  19.930  9629090.0    191861.0    3153.320  19.93
1965  7.335000e+11  928.50  20.545  9629090.0    197787.0    3692.380  20.54
1967  8.620000e+11  940.35  21.160  9629090.0    203713.0    4231.440  21.16
1969  1.071000e+12  952.20  21.650  9629090.0    208466.5    5117.315  21.65
1972  1.280000e+12  980.10  22.140  9629090.0    213220.0    6003.190  22.14

# Q5 US statistics:
#### Column Mean/Average, Compare Population Density, Find min/max NRI & Handle NaN entries

* 1: Calculate and print all the column averages and the column standard deviations.


* 2: Compare the columns 'PD' and 'PD2'. Is there any year when the two columns are not equal (exclude the years with NaN entries and the year 2015 for the 'PD' column)?


* 3: Drop column 'PD2' from the DataFrame df_us.


* 4: Find the maximum value and minimum value of the 'NRI' column in the US (using pandas methods). What years do the min and max values occur?


* 5: Fill some of the NaN entries in df_us by calculating the average of the values stored the year before and the year after the NaN value (i.e., one row above and one row below, Note: this only works if there are values both above and below the NaN entry). Do this for each NaN entry in all the columns. Hint, one way to do this: Try using `.shift(2)`, adding two dfs, dividing the resulting df by two, shifting the average values to the NaN rows with `.shift(-1)` and then filling the NaN with the results using `.fillna(**args**)`


* 6: Fill the rest of the NaN values in the 'NRI' column with the mean of the other values in the column, round the results to two decimal points (hint: use DataFrame method `.fillna(**args**)`). 

**Printing `df_us.tail(10)`** should give you:


<img src="https://www.dropbox.com/s/hv6htxtbavqf4d2/hw3.1.df_tail_3.png?dl=1&2" width="600" height="200" />

In [78]:
df_us.mean()

GDP           7.316417e+12
NRI           9.720250e+02
PD            2.644417e+01
Area          9.663317e+06
Population    2.557296e+05
GDP/capita    2.558969e+04
PD2           2.587273e+01
dtype: float64

In [79]:
df_us.std()

GDP           6.256868e+12
NRI           3.506886e+01
PD            4.425996e+00
Area          7.857100e+04
Population    4.428103e+04
GDP/capita    1.915782e+04
PD2           4.151870e+00
dtype: float64

In [80]:
df_us.dropna()

               GDP     NRI     PD       Area  Population  GDP/capita    PD2
Year
1992  6.540000e+12  1020.0  26.78  9629090.0    257908.0    25357.88  26.78
2002  1.100000e+13   938.7  29.95  9632030.0    288471.0    38132.08  29.95

After I droped the rows that contains "NaN" entries, we obtain the table the above. However, the remainaing years share the same entries for "PD" and "PD2".

In [81]:
df_us = df_us.drop('PD2', axis = 1)

In [82]:
df_us.loc[df_us['NRI'].idxmax()]

GDP           6.540000e+12
NRI           1.020000e+03
PD            2.678000e+01
Area          9.629090e+06
Population    2.579080e+05
GDP/capita    2.535788e+04
Name: 1992, dtype: float64

In [83]:
df_us.loc[df_us['NRI'].idxmin()]

GDP             NaN
NRI           928.5
PD              NaN
Area            NaN
Population      NaN
GDP/capita      NaN
Name: 1965, dtype: float64

Year of NRI max: 1992
Year of NRI min: 1965

In [84]:
df_us = df_us.interpolate()
df_us.tail()

               GDP    NRI      PD       Area  Population  GDP/capita
Year
2002  1.100000e+13  938.7  29.950  9632030.0    288471.0    38132.08
2007  1.450000e+13  938.7  31.320  9632030.0    301656.0    48068.00
2012  1.620000e+13  938.7  32.020  9831510.0    314799.0    51461.41
2014  1.705000e+13  938.7  32.375  9831510.0    318286.5    53545.26
2015  1.790000e+13  938.7  32.730  9831510.0    321774.0    55629.11

In [86]:
#Since we weren't supposed to change the 'NaN' values in 'NRI' for the last four rows from part 5, we'll replace those
#values with the average of the column minus the last four rows instead.
import math as math
mean = df_us.iloc[0:15]['NRI'].mean()
mean = round(mean, 2)
df_us.set_value([2007, 2012, 2014, 2015], 'NRI', mean)
df_us.tail(10)

               GDP      NRI      PD       Area  Population  GDP/capita
Year
1984  4.105000e+12   974.60  24.895  9629090.0    239689.5    17059.72
1987  4.870000e+12   997.30  25.490  9629090.0    245425.0    19843.13
1992  6.540000e+12  1020.00  26.780  9629090.0    257908.0    25357.88
1996  7.575000e+12  1005.00  27.560  9629090.0    265395.5    28454.93
1997  8.610000e+12   971.85  28.340  9629090.0    272883.0    31551.98
2002  1.100000e+13   938.70  29.950  9632030.0    288471.0    38132.08
2007  1.450000e+13   971.88  31.320  9632030.0    301656.0    48068.00
2012  1.620000e+13   971.88  32.020  9831510.0    314799.0    51461.41
2014  1.705000e+13   971.88  32.375  9831510.0    318286.5    53545.26
2015  1.790000e+13   971.88  32.730  9831510.0    321774.0    55629.11

## Extra Credit 1: Simple plotting

* 1: Fill NaN value for column 'Area' in 2015 with the same value as it was in 2014.


* 2: Scatter plot NRI against year. Use `plt.scatter(x,y)` followed by `plt.show()`. Hint: Use `x=df_us.index.values` to access the 'Year' index values.


* 3: Normalize all values in df_us. In order to do so use this formula on all columns: 

    `norm_value = (value - col_mean)/(max(col_value)-min(col_value))`. 
    
    Where `value` is an arbitrary value stored in df_us, `col_mean` is the mean of the column that value belongs to, `max(col_value)` is the maximum value of the same column, and `min(col_value)` is the minimum value of that column. Store the results in a new df called `df_norm`.



**`df_norm.head()` should print:**

<img src="https://www.dropbox.com/s/io6vru0u2qcasga/hw3.dfnorm_head.png?dl=1" width="600" height="200" />




## Extra Credit 1 (continued): Line plot
* **4:** Line plot all the column values in df_norm. The values of df_norm should be plotted on the y-axis and the indices 'Years' should be plotted on the x-axis (try using pandas method `df_norm.plot()` followed by `plt.show()`). What can you say about the results, can you find some kind of correlation between the column values?

# Extra credit 2: Pivot Table

** Note! For this question, reuse the original `df` DataFrame object created in Q2 **

* 1: A pivot table is a multiindexed table, as you can see below. The two indices are 'Country' and 'Year'. Use pandas method **`pivot_table`** on your DataFrame, and specify the multi-level `index=['Area','Year']` and `columns='Variable Name'`. See [http://pandas.pydata.org/pandas-docs/stable/10min.html#pivot-tables](http://pandas.pydata.org/pandas-docs/stable/10min.html#pivot-tables)       (**Note:** Don't assign the argument `values=**arg**`, anything). Store the pivot table as `df`.


* 2: Drop the 'Value' index-level of the pivoted DataFrame by running `df = df.xs('Value', axis=1, drop_level=True)`


* 3: Rename the 'Area' column indicating country name to 'Country' using: `df.index.rename(names=['Country','Year'],inplace=True)`

* 4: Rename the index 'United States of America' to 'USA'. (Hint: Try using the `df.rename(index={**key:value**},inplace=True)` method)


** And as in the US example: **


* 5: Rename the columns to `['GDP','NRI','PD','Area','Population']`.

* 6: Multiply the Area for all countries by 10 (so instead of 10 ha, the unit becomes 100 ha = 1km^2)


Print `df.tail()`, it should look like:

<img src="https://www.dropbox.com/s/nckchy6bvtczsrs/h3.1.df_tail_2.png?dl=1&1" width="600" height="200" />